[
  {
    "menu_id": 0,
    "menu_cat": "palatable",
    "menu_name": "Papi's Fried Whole Chicken",
    "menu_desc": "None",
    "menu_ingredient": "1 lb beef (uncut, preferably brisket) \n¼ cup soy sauce \n1 tsp ground black pepper \n¼ cup sugar \n2 tbsp ginger, minced \n2 cloves garlic crushed \n1 medium-sized onion, minced \n4 cups water \n1 piece beef cube \n2 pieces star anise \n2 tbsp cooking oil \n3 tbsp scallions or green onions, finely chopped",
    "menu_procedure": "Pour the water in a pot and bring to a boil. Put-in the beef and then boil until the meat is tender (about 1 to 2 hours if slow cooked or 20 mins. if using a pressure cooker) When the meat is tender, remove from the pot and allow to cool down. Do not throw away the stock used for boiling. Slice the boiled meat in cubes and set aside. Place the oil in a pan then heat-up. Saute the onion, garlic, and ginger. Put-in the sliced meat and saute for about 2 to 3 minutes Add the soy sauce , 1 cup of beef stock (stock used in boiling the meat), star anise, and beef cube. Stir and then bring to a boil. Put-in the sugar. Stir. Add salt and ground black pepper. Stir and then simmer until the sauce thickens. Garnish with scallions on top. Serve with Garlic Fried Rice and soup Share and Enjoy!",
    "menu_price": "270",
    "menu_image": "palatable_friedwholechicken",
    "menu_short": "P Fried W"
  },
  {
    "menu_id": 1,
    "menu_cat": "palatable",
    "menu_name": "Papi's Fried Half Chicken",
    "menu_desc": "None",
    "menu_ingredient": "None",
    "menu_procedure": "None",
    "menu_price": "135",
    "menu_image": "palatable_friedhalfchicken",
    "menu_short": "P Fried H"
  },
  {
    "menu_id": 2,
    "menu_cat": "palatable",
    "menu_name": "Buffalo Wings",
    "menu_desc": "None",
    "menu_ingredient": "250 g ground beef \n1-inch root ginger chopped \n3~5 fresh water chestnut—peeled and chopped \n1 teaspoon salt \n1 teaspoon five spice powder \n1 teaspoon vegetable oil \nBok choy as needed \ncoriander as needed \nchopped spring onions as needed \nSauce \n1 tablespoon light soy sauce \n1 teaspoon salt \n1 teaspoon roasted sesame seeds \n1 teaspoon vinegar \n1 teaspoon chicken essence\n2 teaspoons chili oil (optional)",
    "menu_procedure": "In a large bowl, add the ground beef and then add salt and five spicy powders in and mix evenly. In one direction please. Then add around 1 teaspoon vegetable oil in, and then continue to stir in one direction. Set aside for 10 minutes. Chop the peeled ginger and peeled water chestnuts into small pieces. Mix ginger and water chestnuts with beef to make the meat stuffing. Fold wontons one by one. Prepare serving bowls and mix all the ingredients for sauces. Bring a pot with water to a boiling and then put the wontons in to cook for around 2 minutes. Add bok choy in. Scoop the boiling water to the serving bowls to make the soup base and then get the wontons out. Sprinkle some chopped spring onion and coriander.",
    "menu_price": "130",
    "menu_image": "palatable_buffalowings",
    "menu_short": "P Buffalo"
  },
  {
    "menu_id": 3,
    "menu_cat": "palatable",
    "menu_name": "Sweet n' Sour Chicken w/ Mushroom",
    "menu_desc": "None",
    "menu_ingredient": "1 lb. beef brisket \n6 pieces star anise \n1 piece beef cube \n5 cups water \n2 tbsp cooking oil \n1 tbsp minced garlic \n1 medium sized onion, minced \n¼ cup green onions, chopped \n14 ounces egg noodles, cooked \n1 cup Chinese cabbage (pechay Baguio), chopped \n4 pieces hard boiled eggs \nsalt and pepper to taste",
    "menu_procedure": "Put the oil in a cooking pot and apply heat Saute the garlic and onions Put-in the beef brisket and cook until the color of the outer part turns light brown Add the beef cube and star anise Pour-in the water and bring to a boil. Allow to boil until beef becomes tender Add salt and pepper to taste Place the cooked egg noodles and Chinese cabbage in a serving bowl Pour the soup and beef brisket on the bowl with noodles then garnish with sliced boiled egg and green onions Serve hot. Share and Enjoy!",
    "menu_price": "140",
    "menu_image": "palatable_sweetandsourchickenwitmushroom",
    "menu_short": "P Sweet"
  },
  {
    "menu_id": 4,
    "menu_cat": "palatable",
    "menu_name": "Buttered Chicken",
    "menu_desc": "None",
    "menu_ingredient": "2 lbs boneless chicken breasts \n1 pack (8 oz) thin egg noodles, cooked according to package instructions \n2 cups chopped Napa cabbage \n1/2 teaspoon garlic powder \n1/4 cup chopped spring onion \n1/4 cup toasted garlic \n6 to 8 cups chicken broth (or combine 6 cups water and 1 ½ piece chicken cube) \n1 tablespoon onion powder \n1 teaspoon ground black pepper \n1 teaspoon salt \n4 to 6 pieces boiled chicken egg \nCarrot strips for garnish (optional)",
    "menu_procedure": "Pour-in chicken broth in a deep cooking pot. Bring to a boil. Add chicken breasts, onion powder, salt, pepper, and garlic powder. Cover and simmer for 30 to 40 minutes. Note: add a little water if necessary. Turn off heat. Remove the chicken breasts and slice as thin as possible. In a wide individual serving bowl, arrange the cooked noodles, chopped Napa cabbage, carrot strips, boiled egg, chicken, spring onions, and toasted garlic. Pour-in the hot broth. Serve. Share and enjoy!",
    "menu_price": "95",
    "menu_image": "palatable_butteredchicken",
    "menu_short": "P Buttered C"
  },
  {
    "menu_id": 5,
    "menu_cat": "palatable",
    "menu_name": "Pancit Bihon",
    "menu_desc": "ancit Bihon or Pancit Guisado is a Filipino noodle dish and is a staple second to rice.",
    "menu_ingredient": "1 lb pancit bihon (Rice Noodles) \n ½ lb. pork, cut into small thin slices \n ½ lb. chicken, cooked, deboned, and cut into thin slices \n ½ lb. pea pods or snow pea \n 1 cup carrot \n ½ small cabbage, chopped \n 1 cup celery leaves, chopped finely \n 1 medium sized onion, chopped \n ½ tbsp garlic, minced \n 1 pc chicken cube \n 5 tbsp soy sauce \n 3 to 4 cups water ",
    "menu_procedure": "In a large pot, Saute the garlic and onion. Add the pork and chicken then let cook for 2 minutes.Add the chicken cube and water then simmer for 15 minutes. Put in the carrots, pea pod, cabbage, and celery leaves and simmer for a few minutes. Remove all the ingredients in the pot except for the liquid and set them aside. In the pot with the liquid in, add the soy sauce and mix well. Add the pancit bihon (makes sure to first soak it in water for about 10 minutes) and mix well. Cook until liquid evaporates completely. Put-in the vegetables and meat that were previously cooked and simmer for a minute or two",
    "menu_price": "95",
    "menu_image": "palatable_pancitbihon",
    "menu_short": "P Pancit B"
  },
  {
  "menu_id": 6,
  "menu_cat": "palatable",
  "menu_name": "Pancit Canton",
  "menu_desc": "Pancit Canton is a great tasting Filipino Noodle dish. It is often served during birthdays and special occasions to symbolize long life. Aside from the symbolism, it is perfectly delicious.",
  "menu_ingredient": "1 pack (250 grams) pancit canton (flour noodles) \n 4 ounces, pork thinly sliced \n 1 piece Chinese style sausage, sliced \n 1 small onion, sliced \n 1 teaspoon minced garlic \n 8 to 10 pieces medium shrimp \n 10 to 12 pieces snap peas or snow peas \n ¾ cup carrot (julienne) \n 1 head small cabbage, chopped \n 1½ cups chicken broth \n 1 tablespoon oyster sauce (opional)\n 3 tablespoons soy sauce \n  ¾ cup water \n  ½ cup chopped flat leaf parsley \n 3 tablespoons cooking oil \n Salt and pepper to taste",
  "menu_procedure": "Place 2 cups of ice and 3 cups water in a large bowl. Set aside. Boil 6 cups of water in a cooking pot. Once the water starts to boil, blanch the snap peas, carrots, and cabbage for 35 to 50 seconds. Quickly remove the vegetables and immerse in bowl with ice cold water. Drain the water after 2 minutes and set aside. Heat a large wok or cooking pot and pour-in the cooking oil. Saute the onion and garlic. Add the pork and sausage slices and continue to cook for 2 minutes. Add-in soy sauce and oyster sauce. Stir. Pour-in chicken broth and water. Add salt and pepper. Let boil. continue to cook for 5 to 10 minutes. Put-in the shrimp and parsley. Cook for 3 minutes. Add more water if needed. Put-in the flour noodles. Gently toss until the noodles absorb the liquid. Add-in the blanched vegetables. Toss and cook for 1 to 2 minutes. Transfer to a serving plate.",
  "menu_price": "95",
  "menu_image": "palatable_pancitcanton",
  "menu_short": "P Pancit c"
  },
  {
    "menu_id": 7,
    "menu_cat": "palatable",
    "menu_name": "Pepper Beef Venicelli",
    "menu_desc": "None",
    "menu_ingredient": "None",
    "menu_procedure": "None",
    "menu_price": "120",
    "menu_image": "palatable_pepperbeefveniceli",
    "menu_short": "P Pepper"
  },
  {
    "menu_id": 8,
    "menu_cat": "palatable",
    "menu_name": "Gising-Gising",
    "menu_desc": "Gising gising is a ground pork and green bean dish cooked in coconut milk. Shrimp paste (bagoong) is used to enhance the flavor. This version calls for chili to make it spicier. If you don’t like spicy foods, you can always omit this ingredient.",
    "menu_ingredient": "1 lb green beans (Baguio beans), chopped (about 3/4 inches) \n 1/2 lb ground pork \n 1 1/2 tablespoons shrimp paste \n 2 cups coconut milk\n 3 cloves garlic, crushed \n 1 medium onion, minced \n 2 tablespoons cooking oil \n 3 pieces chili, chopped (optional) \n 1/2 teaspoon ground black pepper",
    "menu_procedure": "Heat oil in a pan. Sauté garlic and onion. Add pork. Cook for 3 to 5 minutes or until color turns medium brown. Put-in ground black pepper, shrimp paste, and chili. Stir.Pour-in coconut milk. Let boil and simmer for 20 minutes.Add the green beans. Cook for 5 to 7 minutes while stirring gradually. Turn off heat. Serve with white rice.",
    "menu_price": "95",
    "menu_image": "palatable_gisinggising",
    "menu_short": "P Gising"
  },
  {
  "menu_id": 9,
  "menu_cat": "palatable",
  "menu_name": "Onion Rings",
  "menu_desc": "Onion rings are sliced onions that are dipped in a batter, and deep fried until crisp. These are considered as a fast food favorite; it can also be a good replacement for French fries.",
  "menu_ingredient": "1 large yellow onion, sliced \n 1  1/4 cups all-purpose flour \n 1 teaspoon baking powder \n 1 teaspoon salt \n 1 piece egg, beaten \n 1 cup milk \n 1 cup panko bread crumbs  \n 1 teaspoon salt\n 1/4 teaspoon ground black pepper \n 3 cups cooking oil",
  "menu_procedure": "Break up the onion slices into rings. Set aside. Combine flour, baking powder, and salt, in a small bowl and mix well. Dredge the onions on the flour mixture and set aside. Meanwhile, make the batter by adding the egg and milk on the flour mixture and whisk.Dip the onions on the batter and allow the extra batter to drip. Place the breadcrumbs in a plastic bag or container and put-in the onions rings. Heat a cooking pot and pour-in cooking oil. When the oil is hot, deep-fry the onion until the color turns golden brown (usually 2 minutes or so). Remove the onion rings from the cooking pot and place in a plate lined with paper towels, to absorb the excess oil. Transfer to a serving plate and serve.",
  "menu_price": "95",
  "menu_image": "palatable_onionrings",
  "menu_short": "P Onion R"
  },
  {
    "menu_id": 10,
    "menu_cat": "palatable",
    "menu_name": "Chopsuey",
    "menu_desc": "Chopsuey or Chop Suey is a dish made-up of meat (chicken or pork) and seafood (shrimp or fish) cooked with different kinds of vegetables. This dish is considered to be of Chinese origin but there are claims that Chopsuey is of American – Chinese origin that was made famous by Chinese immigrants in America.",
    "menu_ingredient": "¼ lb shrimp \n ½ lb boneless chicken \n 1 tsp garlic \n 2 tsp cornstarch \n 1 tbsp oyster sauce \n ½ piece cabbage, quartered \n 1 cup green bell pepper,sliced \n 1 cup red bell pepper, sliced \n 1 small cauliflower, cut into small pieces\n 1 ½ cup snow peas \n 1 cup carrots, sliced \n 1 cup onion, diced \n 1 cup chicken liver, sliced \n Shrimp juice (derived by crushing the head of the shrimp) or use shrimp bouillon \n 1¼ cup water \n salt and pepper",
    "menu_procedure": "None",
    "menu_price": "120",
    "menu_image": "palatable_chopsuey",
    "menu_short": "P Chopsuey"
  },
  {
    "menu_id": 11,
    "menu_cat": "palatable",
    "menu_name": "Buttered Vegetables",
    "menu_desc": "buttered vegetables is another simple yet healthy dish and usually served as side dish. It is consists of different varieties of vegetables steamed then toss with butter, salt and pepper.",
    "menu_ingredient": "3 cups mixed vegetables(broccoli, carrots, snow peas, beans, cauliflower or any vegetables) \n 3 tablespoons butter, melted \n salt and pepper to taste",
    "menu_procedure": "In a steamer, steam vegetables for 3 minutes or until tender. Transfer the steamed vegetables into serving bowl. Add butter, salt and pepper then toss until well coated. Serve immediately.",
    "menu_price": "120",
    "menu_image": "palatable_butteredvegetables",
    "menu_short": "P Buttered V"
  },
  {
    "menu_id": 11,
    "menu_cat": "palatable",
    "menu_name": "Mixed Seafoods",
    "menu_desc": "None",
    "menu_ingredient": "1 kilo of seafood or any one or a combination of crabs, prawns, squid, clams, mussels and any seafood \n 1 large onion, diced \n  1 thumb sized ginger, sliced into strips \n  1/2 teaspoon of sugar or monosodium glutamate \n  3 table spoons of cooking oil or olive oil \n  1/3 cup water \n  spring onions, cut 1 inch long \n  1/3 cup of oyster sauce \n  2 pieces green finger pepper (sili pag sigang) chopped \n  Salt and pepper to taste",
    "menu_procedure": "Estimated cooking time: 30 minutes. Slice crabs into 2 or 4 if very big.Steam crabs and prawns for 5 minutes. Wash squid and cut into 1 inch long sections. On a big wok, stir fry garlic until golden brown, then add ginger and onions, stir fry for a minute more. Add water and bring to a boil. Add squid, clams, mussels and other uncooked seafood. Simmer for 5 minutes. Add crabs and shrimp. Add the oyster sauce. Salt and pepper to taste. Sprinkle the sugar or monosodium glutamate (vetsin). Add the long green chili. Mix well and bring to a boil. Boil for 3 minutes. Serve hot with steamed rice. Add the long green chili earlier if you prefer your mixed seafood with oyster sauce hot. The above recipe can be used for just one type of seafood like crabs only or a combination of many including fish. ",
    "menu_price": "160",
    "menu_image": "palatable_mixedseafoods",
    "menu_short": "P Mixed Sea"
  },
  {
    "menu_id": 12,
    "menu_cat": "palatable",
    "menu_name": "Sizzling Gambas",
    "menu_desc": "Sizzling Gambas is a shrimp dish that is considered to be both an appetizer and a main dish. Although the term “Gambas” in Spanish pertain to prawns, this dish often uses medium to large sized shrimps (compared to jumbo and colossal prawns) because of price and quantity reasons. On the other hand, the “sizzling” adjective refers to the manner on how the shrimps are presented. A hot metal plate known as a sizzling plate (or fajita plate) is used to serve the dish to make it more appealing and exciting to eat.",
    "menu_ingredient": "1 lb shrimp, peeled and deveined \n 2 tablespoons garlic, minced \n ¼ cup lemon juice \n ½ cup green chili, sliced diagonally \n 1 cup red bell pepper, chopped \n ¼ cup cooking oil or olive oil \n 1 medium-sized onion, quartered \n 2 tablespoons cooking rice wine \n ¼ cup tomato sauce \n 2 tablespoons chili sauce \n Salt and pepper to taste",
    "menu_procedure": "Combine lemon juice and shrimp and marinade for 30 minutes. Pour cooking oil in a wok of frying pan then apply heat. When the oil is hot enough, put-in the garlic and cook until the color turns light brown. Add the onions and red bell pepper then cook until the texture softens. Put-in the shrimps and cook for 2 minutes. Add the cooking rice wine, salt, and pepper then cook for another minute. Add the tomato sauce and stir. Cook for 2 minutes. Put-in the hot sauce and simmer for 30 seconds. Turn off the heat and set-aside. Heat a sizzling plate and transfer the shrimp along with the other ingredients. Top with sliced green chilies and serve.",
    "menu_price": "160",
    "menu_image": "palatable_sizzlinggambas",
    "menu_short": "P Sizzling G"
  },
  {
    "menu_id": 13,
    "menu_cat": "palatable",
    "menu_name": "Fish Fillet w/ Mango Chutney",
    "menu_desc": "None",
    "menu_ingredient": " 2 tbsp tamarind pulp, soaked for 15 minutes in a small bowl of water \n 2 tbsp fish sauce \n  1 tsp turmeric \n 1 tsp freshly ground black pepper \n 1 tsp garlic powder \n 1 kg halibut, sea bass or sea bream fillets \n 1 tbsp self-raising flour or cornflour \n groundnut oil, for shallow-frying \n 2 tbsp ketjap manis, (Indonesian sweet soy sauce) \n chopped coriander, to garnish \n  1 ripe mango, chopped into 1.5cm cubes \n 2 coriander stalks, finely chopped \n 1 large chilli, deseeded and finely sliced \n 1 spring onion, finely sliced \n 2.5 cm ginger, finely chopped \n 1 clove garlic, finely chopped \n  2 tbsp fish sauce \n 2 tbsp fresh lime juice",
    "menu_procedure": "Press the soaked tamarind through a fine sieve to extract the juice. Mix with the fish sauce, turmeric, pepper and garlic powder. Put the fish in a shallow dish and rub with the tamarind mixture. Combine the mango, coriander, chilli, spring onion, ginger and garlic. Season to taste with fish sauce and lime juice. When you are ready to cook the fish, heat some oil in a frying pan large enough to take the fish in a single layer. Rub the fish with the flour. When the oil is very hot, add the fish fillets. Reduce the heat to medium-high, and fry until golden brown, turning once.Serve the fillets topped with a dollop of mango chutney, a squeeze of ketjap manis and a sprinkling of coriander.",
    "menu_price": "160",
    "menu_image": "palatable_fishfilletwithmangochutney",
    "menu_short": "P Fish Fillet"
  },
  {
    "menu_id": 14,
    "menu_cat": "palatable",
    "menu_name": "Tilapia Fillet",
    "menu_desc": "None",
    "menu_ingredient": " 2 tilapia fillets (6 ounces each) \n 1 tablespoon butter, melted \n 1 teaspoon steak seasoning \n 1/2 teaspoon dried parsley flakes \n 1/4 teaspoon dried thyme \n 1/4 teaspoon paprika \n  1/8 teaspoon onion powder \n 1/8 teaspoon salt \n 1/8 teaspoon pepper \n Dash garlic powder",
    "menu_procedure": "Place fillets in a greased 11-in. x 7-in. baking dish. Drizzle with butter. In a small bowl, combine the remaining ingredients; sprinkle over fillets.Cover and bake at 425° for 15 minutes. Uncover and bake 5-8 minutes longer or until fish flakes easily with a fork.",
    "menu_price": "105",
    "menu_image": "palatable_tilapiafillet",
    "menu_short": "P Tilapia"
  },
  {
    "menu_id": 15,
    "menu_cat": "palatable",
    "menu_name": "Spicy Pepper Beef w/ Broccoli",
    "menu_desc": "None",
    "menu_ingredient": "1 pound hanger or flank steak, sliced into strips \n 2 cups broccoli florets \n 2 large red bell peppers \n 1 small red onion \n ½ tablespoon sesame oil \n salt and pepper, to taste \n ¼ cup hoisin sauce \n 1 garlic clove, minced \n  1 tablespoon sriracha (or less –or omit – if you don’t like spice) \n ¼ cup freshly squeezed orange juice \n 2 tablespoons low sodium soy-sauce",
    "menu_procedure": "In a medium bowl, whisk together the hoisin, garlic, sriracha, orange juice and soy sauce and set aside. Add in the steak strips to the marinade and refrigerate for at least 20 minutes. Meanwhile, place a medium pot filled halfway with water over high-heat and bring to a boil. Once boiling, add in the broccoli florets and blanch for 2 minutes. Drain the broccoli into a colander and then set aside. Also, spiralize (with Blade A) your peppers and onions. Trim all noodles. Once steak is done marinating, place a large skillet over medium-high heat. Once heated, add in the beef and cook for 2 minutes per side (for medium) and then transfer to a cutting board. Reserve any extra marinade. Immediately, add the sesame oil and then peppers and onions to the skillet. Season with salt and pepper. Cook, tossing occasionally, until peppers and onions soften. Once vegetables are tender, add in the reserved beef marinade and broccoli. Toss together for a minute or until fully combined. Plate the vegetables and top with slices of beef.",
    "menu_price": "160",
    "menu_image": "palatable_spicypepperbeefwithbroccoli",
    "menu_short": "P Spicy"
  },
  {
    "menu_id": 16,
    "menu_cat": "palatable",
    "menu_name": "Pork w/ Eggplant in Plum Sauce",
    "menu_desc": "None",
    "menu_ingredient": "1 eggplant \n 1/2 pound lean ground pork \n 1/4 cup Dynasty Plum Sauce \n 1 teaspoon Dynasty Szechwan Chili Sauce \n 1 tablespoon Kikkoman Soy sauce \n1 tablespoon diced ginger \n 1 tablespoon chopped green onion \n 1 tablespoon minced garlic \n 1 tablespoon oil",
    "menu_procedure": "Mix pork with soy sauce, ginger, green onion, and garlic in a small bowl. Let it stand for 15 minutes.Cut up eggplant in bite-size cubes. In a large frying pan, heat up 1 tablespoon oil and stir in the eggplant, cook for 3 minutes or until soft. In the same pan, stir in the pork mixture and cook for another 3 minutes until browned. Add in plum sauce and chili sauce, stir for 3 minutes until well coated and fully cooked. Remove from heat and serve with rice.",
    "menu_price": "195",
    "menu_image": "palatable_porkwitheggplantinplumsauce",
    "menu_short": "P Pork"
  },
  {
    "menu_id": 17,
    "menu_cat": "palatable",
    "menu_name": "General Tso's Pork",
    "menu_desc": "None",
    "menu_ingredient": "None",
    "menu_procedure": "None",
    "menu_price": "195",
    "menu_image": "",
    "menu_short": "P General"
  },
  {
    "menu_id": 18,
    "menu_cat": "palatable",
    "menu_name": "Ginger Beef w/ Asparagus in Hoisin",
    "menu_desc": "None",
    "menu_ingredient": "None",
    "menu_procedure": "None",
    "menu_price": "195",
    "menu_image": "",
    "menu_short": "P Ginger"
  },
  {
    "menu_id": 19,
    "menu_cat": "palatable",
    "menu_name": "Chicken Asparagus in Oyster",
    "menu_desc": "None",
    "menu_ingredient": "2 boneless chicken breasts, chopped in bite sized pieces \n 4 tablespoons vegetable oil \n 1 teaspoon ground ginger \n 2 garlic cloves, minced \n 10 -12 asparagus spears, broken off at soft spot \n 1 onion, sliced \n 2 cups mushrooms, sliced \n 2 tablespoons oyster sauce",
    "menu_procedure": "Heat up 2 tbsp oil in a wok, when hot, add chicken, 1 minced clove garlic and ½ tsp ginger; cook through, remove chicken and set aside. Clean pan and add 2 tbsp oil and add asparagus, 1 minced clove garlic and ½ tsp ginger, cook for 2 minutes. Add onion and mushrooms and cook until veggies are just done. Add the oyster sauce.",
    "menu_price": "195",
    "menu_image": "palatable_chickenasparagusinoyster",
    "menu_short": "P Chicken A"
  },
  {
    "menu_id": 20,
    "menu_cat": "palatable",
    "menu_name": "Sizzling Sisig",
    "menu_desc": "None",
    "menu_ingredient": "2 pounds pig face (snouts, ears and jowls) \n 1-1/2 cups vinegar \n water \n 1 bay leaf \n 2 tablespoons salt and more to taste \n 1 teaspoon whole pepper corns \n 1 tablespoon oil \n 1 large onion, peeled and diced \n 2 to 3 cloves garlic, peeled and minced \n 1 thumb-size ginger, peeled and minced \n 5 Thai chili peppers, stemmed and minced (more or less depending on spiciness desired) \n 2 tablespoons soy sauce \n pepper to taste \n calamansi \n cut into halves",
    "menu_procedure": "In a pot, combine pig face, 1 cup of the vinegar, bay leaf, 2 tablespoons salt, pepper corns and enough water to completely cover pork. Bring to a boil, skimming scum that accumulates on top. Lower heat, cover and simmer for about 45 minutes to 1 hour or until meat is tender. Remove from heat and drain well, discarding liquid.Over hot coals, grill pork for about 4 to 6 minutes on each side or until crisp and slightly charred. Allow to cool to touch and dice. In a pan over medium heat, heat oil. Add ¾ of the onions, garlic and ginger. Cook for about 2 to 3 minutes or until limp and aromatic. Add meat and stir gently to combine. Add chili peppers, soy sauce and the remaining ½ cup vinegar. Bring to a boil, uncovered and without stirring, for about 3 to 5 minutes. Continue to cook, stirring occasionally, for about 8 to 10 minutes or until pork is heated through and liquid is absorbed. Season with salt and pepper to taste. Arrange on hot plates and top with remaining onions. Serve with calamansi.",
    "menu_price": "130",
    "menu_image": "palatable_sizzlingsisig",
    "menu_short": "P Sizzling S"
  },
  {
  "menu_id": 21,
  "menu_cat": "palatable",
  "menu_name": "Sizzling Hotdog",
  "menu_desc": "Sizzling hotdog is another easy dish that is made of hotdog cooked in a blend of ketchup and hot sauce then top with onion rings. I got this idea from one of the resto bar somewhere in Quezon City. They served this kind of dish as appetizer or pulutan together with cold beer.",
  "menu_ingredient": "5 pieces jumbo hotdog, slice diagonally \n 1 large white onion, cut into ring \n 1/2 cup tomato ketchup \n 1 tablespoon hot sauce(optional) \n 1/4 cup butter or margarine \n 3 tablespoons olive oil",
  "menu_procedure": "In a pan, heat oil then saute hotdogs. Add tomato ketchup and hot sauce then stir well. Add onions then cooked for a minute. Heat the sizzling plate then grease with butter. Put the hotdog mixture then serve immediately.",
  "menu_price": "110",
  "menu_image": "palatable_sizzlinghotdog",
  "menu_short": "P Sizzling Hot"
},
  {
    "menu_id": 22,
    "menu_cat": "palatable",
    "menu_name": "Bicol Express",
    "menu_desc": "The outcome of this Bicol Express Recipe can be described as pork cooked in coconut milk with shrimp paste and chilies. No wonder the name of this dish was derived from a Philippine region (Bicol) wherein Coconuts are abundant and the use of chilies is emphasized in most local meals",
    "menu_ingredient": "\n 3 cups coconut milk \n 2 lbs pork belly, cut into strips \n ½ cup Shrimp Paste \n 1 tbsp Garlic, minced \n 6 pieces Thai chili or Serrano pepper \n 3 tablespoons minced ginger \n 1 medium onion, minced \n 2 tablespoons cooking oil \n Salt and Pepper to taste",
    "menu_procedure": "Heat a pan and then pour-in the cooking oil. Sauté the garlic, onion, and ginger. Add the pork and then continue cooking for 5 to 7 minutes or until the color becomes light brown. Put-in the shrimp paste and Thai chili or Serrano pepper. Stir. Pour the coconut milk in. Bring to a boil. Simmer for 40 minutes or until the pork is tender. Add salt and ground black pepper to taste",
    "menu_price": "130",
    "menu_image": "palatable_bicolexpress",
    "menu_short": "P Bicol"
  },
  {
  "menu_id": 23,
  "menu_cat": "palatable",
  "menu_name": "Lechon Paksiw Bagnet",
  "menu_desc": "Lechon Paksiw na Bagnet is another simple and easy Filipino pork dish. This is similar to lechon paksiw but instead of roasted pork we used bagnet. Bagnet is a popular delicacy in Ilocos made from pork belly deep fried until crispy and blister on skin.",
  "menu_ingredient": "1/2 kilo bagnet, cut into serving pieces \n 1/4 cup lechon sauce \n 3 cloves garlic, crushed \n 1 medium onion, chopped \n 1 teaspoon peppercorn \n 1 bay leaf(laurel) \n 2 tablespoon vinegar \n 1/4 cup brown sugar \n 1/4 cup water \n salt to taste \n 1/4 cup liver spread(optional)",
  "menu_procedure": "In a pan, heat bagnet until start to render oil. Add garlic and onions then saute until translucent. Pour water, peppercorn and bay leaf then bring to boil.Pour vinegar and simmer for 5 minutes. Add the sugar, liver spread and lechon sauce then simmer for another 5 minutes. Adjust seasoning with salt according to taste. Remove from heat and serve with steamed rice.",
  "menu_price": "160",
  "menu_image": "palatable_lechonpaksiwbagnet",
  "menu_short": "P Lechon P"
},
  {
  "menu_id": 24,
  "menu_cat": "palatable",
  "menu_name": "Crispy Bagnet",
  "menu_desc": "Bagnet is a deep fried crispy pork belly dish that is similar to lechon kawali. It originated from Ilocos and is considered to be a top favorite among Filipinos. This is best served bagoong monamon. it is a dip made of fermented anchovies.",
  "menu_ingredient": "2 to 2½ lbs. whole pork belly \n 1 medium red onion \n 1 tablespoon whole black peppercorn \n 1½ tablespoons salt \n 6 cloves crushed garlic \n 4 to 6 cups water \n 3 cups cooking oil",
  "menu_procedure": "Arrange the pork belly in a wide and deep cooking pot. Pour-in the water. Make sure that the pork belly is fully submerged in water. Let boil. Once the water starts to boil, add the garlic, onion, 1 tablespoon salt, and whole black peppercorn. Simmer for 30 to 40 minutes.Remove the boiled pork belly from the cooking pot and place in a plate. Let it cool to room temperature. Rub the remaining ½ tablespoon of salt all over the boiled pork belly. Let is stay for 10 to 20 minutes. Heat the cooking oil in a deep cooking pot. When the oil gets hot, gently put-in the pork belly and deep-fry in medium heat until the pork belly turns golden brown and the texture gets crispy. The oil will splatter during this process, so be careful. Make sure that you do not cover the cooking pot completely while deep frying. You can put a splatter guard on top of the cooking pot to control the oil. Once the pork belly is golden brown and crispy, remove it from the cooking pot and arrange in a plate lined with paper towel. Turn the stove off and let the pork belly cool down to room temperature. When the pork belly cools down, heat-up the oil on more time. Deep fry the same pork belly for the second time in medium heat for 5 to 10 minutes or until it gets extra crispy. Remove from the cooking pot and place in a plate lined with paper towel. Let the towel absorb the excess oil. Slice the pork bagnet into serving pieces and serve with bagoong monamon (also known as bugguong munamon) or even guinamos or bagoong Balayan. Note: you can squeeze lemon or calamansi on the bagoong to make it taste better.",
  "menu_price": "160",
  "menu_image": "palatable_crispybagnet",
  "menu_short": "P Crispy B"
},
  {
    "menu_id": 25,
    "menu_cat": "palatable",
    "menu_name": "Barbecued Liempo",
    "menu_desc": "None",
    "menu_ingredient": "1 kilo pork belly, sliced into 3/4 inch thick \n 1/2 cup soy sauce \n 1 piece lemon or 3 to 4 pieces calamansi, extract the juice \n 1/2 tsp ground black pepper \n 3 Tbsp. washed or brown sugar \n 1 tsp salt \n 4 cloves garlic, crushed \n 1 pc red onion, minced \n 1/4 cup banana catsup \n 3/4 cup beer \n 1 tbsp cooking oil",
    "menu_procedure": "Let it cook over the charcoal and baste it with the marinade using the basting brush. Turn the meat over using a pair of tongs and brush it again with the marinade to avoid burning and drying up. Repeat the process again until the pork belly is cooked. Transfer it to a serving plate and serve hot with vinegar and chili dip.",
    "menu_price": "160",
    "menu_image": "palatable_barbecuedliempo",
    "menu_short": "P Barbecued L"
  },
  {
  "menu_id": 26,
  "menu_cat": "palatable",
  "menu_name": "Dinuguan",
  "menu_desc": "Dinuguan is a Filipino stew made of pork meat cooked in pig’s blood, vinegar and spices. Offal parts are traditionally used in this rich and spicy dish but since I was able to intrigue G enough to give it a try, I  used pork belly to tame the fear factor. He already has to wrestle with the idea of eating pork blood and to add bits and pieces of ears, snouts, stomach and kidneys into the mix might be too much for the poor guy to handle in one sitting.",
  "menu_ingredient": " 10 ounces pig's blood \n 1 cup vinegar \n 1 tablespoon oil \n 1 onion, peeled and chopped \n 4 cloves garlic, peeled and minced \n 1 small knob ginger (about 1 teaspoon), peeled and minced \n 2 pounds pork belly, cut into ½-inch strips \n 1 tablespoon fish sauce \n 1 cup water \n 1 tablespoon brown sugar \n 2 finger chilies \n salt and pepper to taste",
  "menu_procedure": "In a bowl, combine pig's blood and about 2 tablespoons of the vinegar. Stir well. In a pot over medium heat, heat oil. Add onions, garlic and ginger and cook until limp. Add pork and cook, stirring occasionally, until lightly browned. Add fish sauce and cook for about 1 to 2 minutes. Add vinegar and bring to a boil. Cook, uncovered and without stirring, for about 5 minutes or until slightly reduced. Add water and bring to a boil. Lower heat, cover and continue to cook for about 15 to 20 minutes or until meat is tender.",
  "menu_price": "160",
  "menu_image": "palatable_dinuguan",
  "menu_short": "P Dinuguan"
},
  {
    "menu_id": 27,
    "menu_cat": "palatable",
    "menu_name": "Pork Hamonado",
    "menu_desc": "Pork Hamonado is simply pork sweetened in pineapple sauce. You can typically find sweetness in some Filipino dishes and this is just one of them. This dish is usually served during the Christmas season along with other sumptuous dishes that I plan to feature soon. Some of you might be thinking if sugar can really go well with meat just like with this Pork Hamonado Recipe.",
    "menu_ingredient": "2 lbs pork butt or loin (about 1 kilo) \n 2 cups pineapple juice \n 2 cups pineapple chunks \n 3 tbsp soy sauce \n 5 tbsp brown sugar \n 3 tbsp. cooking oil \n 1 cup beef broth",
    "menu_procedure": "Mix the pineapple juice, sugar, and soy sauce in a large bowl. Marinate pork with the pineapple juice, sugar, and soy sauce mixture for about 1 to 3 hours. Remove the pork from the marinade and set the remaining mixture aside. Heat the oil in a pan and fry the marinated pork until the meat turns light brown (approximately 3 to 5 minutes). Pour in the remaining marinade mixture together with the pineapple chunks and beef broth and simmer for 45 to 60 minutes. Add salt and pepper to taste.",
    "menu_price": "160",
    "menu_image": "palatable_porkhamonado",
    "menu_short": "P Pork H"
  }
]